[
  {
    "title": "Home Server, VPS and Documentation",
    "description": "I currently operate two servers, one at home and one hosted online. My home server acts as a file server, VPN, photo library and media server along with many different services running on Docker. My VPS contains more Docker services such as hosting for my personal website, my Discord bot, analytics, image organisation and other useful tools.",
    "image": "homelab.webp",
    "techStack": ["Docker", "Debian", "MkDocs"],
    "demoLink": "https://docs.jakefarrell.ie",
    "codeLink": "https://github.com/CheeseLad/docs"
  },
  {
    "title": "DCU Media Production Society Website",
    "description": "Built using HTML, CSS, Bootstrap and Django, I created a custom website for DCU's Media Production Society as part of my tasks as a webmaster. It features dynamic content for our upcoming events, automated DCUfm data, details about the history of MPS, information about the committee and much more!",
    "image": "dcumps.webp",
    "techStack": ["Django", "Bootstrap", "SQLite", "JavaScript", "Docker"],
    "demoLink": "https://dcumps.ie",
    "codeLink": "https://github.com/DCUMPS/dcumps-website-django"
  },
  {
    "title": "DCU Fotosoc Website",
    "description": "Developing a full stack website built using React, TailwindCSS and Firebase to fulfil the requirements of the society. Utilising the Stripe API to allow the society to sell merchandise and our yearly photo collection book.",
    "image": "fotosoc.webp",
    "techStack": ["React", "Firebase", "Tailwind CSS", "Stripe API"],
    "demoLink": "https://dcufotosoc.ie",
    "codeLink": "https://github.com/CheeseLad/fotosoc"
  },
  {
    "title": "Redbrick Email Generator",
    "description": "This tool allows the Redbrick committee to easily generate emails using HTML tags via BeautifulSoup and Jinja into a preconfigured format, and enables emails to be sent directly from the website using smtplib. The web UI was created using Tailwind CSS and is powered by Flask.",
    "image": "redbrick.webp",
    "techStack": ["Python", "Jinja", "BeautifulSoup", "Flask"],
    "demoLink": "https://redbrickgenerator.jakefarrell.ie",
    "codeLink": "https://github.com/CheeseLad/Redbrick-Email-Generator"
  },
  {
    "title": "Clubs & Societies API",
    "description": "Allows you to get information about societies and clubs from university websites using the Assure Memberships Platform for use in other applications. This API is utilised in my other projects such as the DCU Media Production Society website and the DCU Fotosoc website, displaying upcoming event information to members.",
    "image": "csapi.webp",
    "techStack": ["Python", "BeautifulSoup", "Flask", "Swagger"],
    "demoLink": "https://clubsandsocs.jakefarrell.ie",
    "codeLink": "https://github.com/CheeseLad/clubsandsocs-api"
  },
  {
    "title": "The College View App",
    "description": "Developing an iOS & Android app for The College View - DCU's independent student newspaper using Flutter and the WordPress REST API. The app allows users to view articles and categories, submit their own articles and search for articles, the app is planned to be released on both the Apple App Store and the Google Play Store.",
    "image": "tcvapp.webp",
    "techStack": ["Flutter", "WordPress REST API", "Dart"],
    "demoLink": "https://tcvapp.jakefarrell.ie",
    "codeLink": "https://github.com/CheeseLad/thecollegeview"
  }
]
